Feature: BackOff
	In order to คำนวณบทลงโทษในการรอคอยได้
	As a ระบบ
	I want ตรวจสอบความถูกต้องในการจัดการคำขอของผู้ใช้

Background:
	Given ขณะนี้เวลา '1/1/2020 00:00:00'

Scenario: เบอร์โทรที่ยังไม่เคยมีบันทึกประวัติมาก่อนขอทำรายการ จะต้องขอดำเนินรายการได้ และจะต้องรอ 1 นาทีถึงจะทำขอทำรายการใหม่ได้
	Given รายการเบอร์โทรในระบบเป็นดังนี้
		|Phone|AttemptCount|
	When เบอร์โทร '0914185401' ขอทำรายการ
	Then ขอดำเนินรายการได้ โดยเป็นการขอครั้งที่ '1' และจะขอทำรายการได้ใหม่เมื่อเวลา '1/1/2020 00:01:00'

Scenario: เบอร์โทรที่ยังขอไม่เกิน 3 ครั้งขอทำรายการ จะต้องขอดำเนินรายการได้ และจะต้องรอ 1 นาทีถึงจะทำขอทำรายการใหม่ได้
	Given รายการเบอร์โทรในระบบเป็นดังนี้
		| Phone      | AttemptCount |
		| 0914185400 | 0            |
		| 0914185401 | 1            |
		| 0914185402 | 2            |
	When เบอร์โทร '<Phone>' ขอทำรายการ
	Then ขอดำเนินรายการได้ โดยเป็นการขอครั้งที่ '<ExpectedAttemptCount>' และจะขอทำรายการได้ใหม่เมื่อเวลา '<ExpectedUnlockedTime>'

	Examples:
		| Phone      | ExpectedAttemptCount | ExpectedUnlockedTime |
		| 0914185400 | 1                    | 1/1/2020 00:01:00    |
		| 0914185401 | 2                    | 1/1/2020 00:01:00    |
		| 0914185402 | 3                    | 1/1/2020 00:01:00    |

Scenario: เบอร์โทรที่ทำรายการมาแล้ว 3 ครั้งขอทำรายการ จะต้องขอดำเนินรายการได้ และจะต้องรอ 30 นาทีถึงจะทำขอทำรายการใหม่ได้
	Given รายการเบอร์โทรในระบบเป็นดังนี้
		| Phone      | AttemptCount |
		| 0914185403 | 3            |
	When เบอร์โทร '0914185403' ขอทำรายการ
	Then ขอดำเนินรายการได้ โดยเป็นการขอครั้งที่ '4' และจะขอทำรายการได้ใหม่เมื่อเวลา '1/1/2020 00:30:00'

Scenario: เบอร์โทรถูกล๊อคและยังไม่ถึงเวลาที่กำหนดมาขอทำรายการ จะต้องดำเนินรายการไม่ได้ จนกว่าจะถึงเวลาที่กำหนด
	Given รายการเบอร์โทรในระบบเป็นดังนี้
		| Phone      | AttemptCount | UnlockedTime      |
		| 0914185404 | 4            | 1/1/2020 00:30:00 |
	And ขณะนี้เวลา '<CurrentTime>'
	When เบอร์โทร '0914185404' ขอทำรายการ
	Then ขอดำเนินรายการไม่ได้ โดยเป็นการขอครั้งที่ '4' และจะขอทำรายการได้ใหม่เมื่อเวลา '1/1/2020 00:30:00'

	Examples:
		| CurrentTime       |
		| 1/1/2020 00:28:00 |
		| 1/1/2020 00:29:00 |
		| 1/1/2020 00:29:59 |

Scenario: เบอร์โทรถูกล๊อคแต่เลยเวลาที่กำหนดมาขอทำรายการ จะต้องขอดำเนินรายการได้ และจะต้องรอ 30 นาทีถึงจะทำขอทำรายการใหม่ได้
	Given รายการเบอร์โทรในระบบเป็นดังนี้
		| Phone      | AttemptCount | UnlockedTime      |
		| 0914185404 | 4            | 1/1/2020 00:30:00 |
	And ขณะนี้เวลา '<CurrentTime>'
	When เบอร์โทร '0914185404' ขอทำรายการ
	Then ขอดำเนินรายการได้ โดยเป็นการขอครั้งที่ '5' และจะขอทำรายการได้ใหม่เมื่อเวลา '<ExpectedUnlockedTime>'

	Examples:
		| CurrentTime       | ExpectedUnlockedTime |
		| 1/1/2020 00:30:00 | 1/1/2020 01:00:00    |
		| 1/1/2020 00:30:10 | 1/1/2020 01:00:10    |